---
type: CorrectionFactorSet
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# CorrectionFactorSet

`Autodesk.Revit.DB.Electrical.CorrectionFactorSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CorrectionFactorSet | — | `public CorrectionFactorSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( CorrectionFactor item )` |
| Method | Erase | — | `public virtual int Erase ( CorrectionFactor item )` |
| Method | ForwardIterator | — | `public virtual CorrectionFactorSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( CorrectionFactor item )` |
| Method | ReverseIterator | — | `public virtual CorrectionFactorSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |